* build

#+name: lisp
#+begin_src lisp :results lisp
  (ql:quickload :parsing-assembler)
#+end_src

#+name: lisp
#+begin_src lisp
  (ql:quickload :parsing-assembler/use)
#+end_src

#+name: lisp
#+begin_src lisp
  (ql:quickload :parsing-assembler/test)
#+end_src

#+name: lisp
#+begin_src lisp :results output
  (parsing-assembler::test0)
#+end_src

#+name: lisp
#+begin_src lisp :results output
  (parsing-assembler::test1)
#+end_src
#+name: lisp
#+begin_src lisp :results output
  (parsing-assembler::test2)
#+end_src
#+name: lisp
#+begin_src lisp :results output
  (parsing-assembler::test3)
#+end_src

#+RESULTS: lisp
: **** PASM (tracing NIL)
: pasm-filter-stream #<STANDARD-GENERIC-FUNCTION PARSING-ASSEMBLER::SKIP-SPACES-AND-COMMENTS (1)>
: pasm-filter-stream #<STANDARD-GENERIC-FUNCTION PARSING-ASSEMBLER::RMSPACES (1)>
:       result=x+y

